[
    {
        "name": "James Baldwin",
        "source": "Meeting the Man",
        "date": "(1970)",
        "imageUrl": "https://live.staticflickr.com/65535/54384644692_86d5f904b0_o.gif",
        "text": "Love has never been a popular movement, and no one's ever wanted, really, to be free. The world is held together...by the love and the passion of a very few people.",
        "notes": "I think James Baldwin was the best to ever do it. Amazing orator."
    },
    {
        "name": "James Baldwin",
        "source": "The Struggle of the Artist",
        "date": "(1969)",
        "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/4/49/James_Baldwin_5_Allan_Warren.jpg",
        "text": "If it hurt you that is not what is important. Everyone is hurt. What is important, what bullwhips you, what drives you, what torments you, is that you must find some way of using this to connect you with everyone else alive. Its all you have to do with it. You must understand your pain is trivial except insofar as you can use it to connect with other people's pain, and insofar as you can do that with your pain, you can be released from it and then hopefully, it works the other way around too. Insofar as I can tell you what it is like to suffer, perhaps I can help you suffer less.",
        "notes": "I spent all of last spring sitting in the Library, trying to fend off an exsistential crisis with books. The right arm got tan from sitting next to the window. I was scared that creative work was meaningless. This speech reminded me to stop worrying about myself. The important thing is that your work is in service of your community."
    },
    {
        "name": "James Baldwin",
        "source": "Giovanni's Room",
        "date": "(1956)",
        "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/1/12/JamesBaldwin1964.jpg",
        "text": "Somebody... Your father or mine, should have told us that not many people have ever died of love. But multitudes have perished, and are perishing every hour-and in the oddest places-for the lack of it.",
        "notes": "More James Baldwin! Sorry! This book is awesome and devasting and reminds me to stop being afraid all the time."
    },
    {
        "name": "Susan Sontag",
        "source": "On Photography",
        "date": "(1977)",
        "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/f/f1/Susan_Sontag_1979_%C2%A9Lynn_Gilbert.jpg",
        "text": "All photographs are memento mori. To take a photograph is to participate in another person's (or thing's) mortality, vulnerability, mutability. Precisely by slicing out this moment and freezing it, all photographs testify to time's relentless melt.",
        "notes": "I frequently wonder what she would think about social media. The violence of photography and the proliferation of aesthetic consumerism through aggressive framing of our online identities... 24 hour live streams, our culture of productivity. Called it in 1977!!"
    },
    {
        "name": "Susan Sontag",
        "source": "Against Intepretation",
        "date": "(1966)",
        "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/4/47/Susan_Sontag_%281966_author_photo_-_Against_Interpretation%29.jpg",
        "text": "What is important now is to recover our senses. We must learn to see more, to hear more, to feel more.",
        "notes": "Our phones inudate us with sensory information, bright colors, flashing lights... cacophony! How do we step away... use silence to learn how to hear again...??"
    },
    {
        "name": "Kwame Ture",
        "source": "Speech at the University of Georgia",
        "date": "(1979)",
        "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/3/3d/Kwame_Ture_at_a_1966_Mississippi_press_conference.jpg",
        "text": "If you are struggling for justice you can never lose—even if they kill you.",
        "notes": "Kwame Ture, such an inspiring speaker. Dedicated his life to fighting Imperialism and Apartheid."
    },
    {
        "name": "Michael Parenti",
        "source": "Yellow Lecture",
        "date": "(1986)",
        "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/9/95/Michael_Parenti.jpg",
        "text": "...the Third World is not poor. You do not go to poor countries to make money. There are very few poor countries in this world, most countries are rich... only the people are poor... these countries are not underdeveloped, they're over exploited.",
        "notes": "Great introductory speech for anti-capitalist thought. Important to reframing your thinking of global class systems and understanding the relationship between imperialism and capital."
    },
    {
        "name": "Judith Butler",
        "source": "Imitation and Gender Insubordination",
        "date": "(1993)",
        "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/b/bf/JudithButler2013.jpg",
        "text": "Drag consistutes the mundane way in which genders are appropriated, theatricalized, worn, and done; it implies that all gendering is a kind of impersonation and approximation. If this is true, it seems, there is no original or primary gender that drag imitates, but gender is a kind of imitation for which there is no original; in fact, it is a kind of imitation that produces the very notion of the original as an effect and consequence of the imitation itself.",
        "notes": "Shaped my view of gender and influenced my ability to articulate facets of my identity."
    },
    {
        "name": "Robert Glück",
        "source": "Margery Kempe (1994)",
        "date": "(1994)",
        "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/e/e5/Unknown_painter_-_Transfiguration_of_Christ_-_WGA23487.jpg",
        "text": "...gender the extent we go in order to be loved.",
        "notes": "This book is sooo super crazy. Sparked a brief medieval kick."
    },
    {
        "name": "Basho",
        "source": "Frog Haiku",
        "date": "17th Cen.",
        "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/1/15/Frog_by_Ito_Jakuchu.jpg",
        "text": "The old pond / frog jumps in / plop",
        "notes": "Says it all!"
    },
    {
        "name": "Mayakovsky",
        "source": "Cloud in Trousers",
        "date": "(1915)",
        "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/5/50/Majakovszkij.jpg",
        "text": "Maria come closer. / Naked and shameless or trembling in fear, / give me your beatiful mouth. / My heart and I never live in May, / we're stuck in a hundred Aprils.",
        "notes": "Mayakovsky is one of my favorite guys of all time. At the top of my list of coolest guys ever. Obsessed with his whole circle of artists (Constructivists v. Futurists, early 20th cen. Soviet avant garde...!) This poem is so beautiful."
    },
    {
        "name": "Anne Carson",
        "source": "Eros the Bittersweet",
        "date": "Eros the Bittersweet",
        "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/e/e5/Anne_Carson%2C_poet%2C_at_the_2024_National_Book_Awards_finalist_reading_5.jpg",
        "text": "Eros is an issue of boundries. He exists because certain boundaries do. In the interval between reach and grasp, between glance and counterglance, between 'I love you' and 'I love you too,' the absent presence of desire comes alive. But the boundaries of time and glance and I love you are only aftershocks of the main, inevitable boundary that creates Eros: the boundary of flesh and self between you and me. And it is only, suddenly, at the moment when I would dissolve that boundary, I realize I never can.",
        "notes": "Such a crazy good essay that covers the classics, desire, and writing."
    },
    {
        "name": "Anne Carson",
        "source": "Autobiography of Red",
        "date": "(1998)",
        "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/5/55/Hercules_verslaat_Geryon%2C_RP-P-1907-2059.jpg",
        "text": "He loved lightning He lived on an island His mother was a / Nymph of a river that ran to the sea His father was a gold / Cutting tool Old scholia say that Stesichorus says that / Geryon had six hands and six feet and wings He was red and / His strange red cattle excited envy Herakles came and / Killed him for his cattle / The dog too",
        "notes": "Fragment of a poem from a larger poetic novel. If I was king I would order every 20 year old to read Anne Carson. Potentially one of my favorite reads ever and also incredibly short, please read!!!"
    },
    {
        "name": "Audre Lorde",
        "source": "Uses of the Erotic: The Erotic as Power",
        "date": "(1978)",
        "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/e/e8/Audre_lorde.jpg",
        "text": "We have been raised to fear the yes within ourselves, our deepest cravings. But, once recognized, those which do not enhance our future lose their power and can be altered. The fear of our desires keeps them suspect and indiscriminately powerful, for to suppress any truth is to give it strength beyond endurance.",
        "notes": "Another reading that reminds me to be brave. Our culture encourages productivity at the cost our desires. Don't sacrifice yourself for Capital."
    },
    {
        "name": "Frederic Jameson",
        "source": "Quoted by Mark Fisher in Capitalist Realism",
        "date": "(2009)",
        "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/f/fb/Rainer_Ganahl_Seminars_Lectures_%285438703900%29.jpg",
        "text": "It's easier to imagine the end of the world than the end of capitalism",
        "notes": "Capitalist Realism is a great (depressing) read. Ever wonder why culture feels stagnant? Read Fisher !!"
    },
    {
        "name": "Stendhal",
        "source": "On Love",
        "date": "(1822)",
        "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/3/3d/Stendhal.jpg",
        "text": "In the salt mines, nearing the end of the winter season, the miners will throw a leafless wintry bough into one of the abandoned workings. Two or three months later, through the effects of the waters saturated with salt which soak the bough and then let it dry as they recede, the miners find it covered with a shining deposit of crystals. The tiniest twigs no bigger than a tom-tit’s claw are encrusted with an infinity of little crystals scintillating and dazzling. The original little bough is no longer recognizable; it has become a child’s plaything very pretty to see. When the sun is shining and the air is perfectly dry the miners of Hallein seize the opportunity of offering these diamond-studded boughs to travellers preparing to go down to the mine",
        "notes": "I think about this concept all the time. So crazy (real) to get rejected by a beautiful woman and write a 500 page book on love. The 1800s were wild."
    },
    {
        "name": "Sophocles",
        "source": "Trans. Radt & Carson",
        "date": "(1977)",
        "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/1/19/Sophocles_pushkin.jpg",
        "text": "This disease is an evil bound upon the day. / Here's a comparison-not bad, I think: / when ice gleams in the open air, / children grab. / Ice-crystal in the hands is / at first a pleasure quite novel. / But there comes a point- / you can't put the melting mass down, / you can't keep holding it. / Desire is like that. / Pulling the lover to act and not to act, / again and again, pulling.",
        "notes": "Reading Carson always reminds me that I need to get into the classics."
    },
    {
        "name": "Walter Benjamin",
        "source": "The Work of Art in the Age of Its Technological Reproducibility",
        "date": "(1935)",
        "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/c/cc/Walter_Benjamin_vers_1928.jpg",
        "text": "Humanity’s self-alienation has reached such a degree that it can experience its own destruction as an aesthetic pleasure of the first order.",
        "notes": "Truly wish I could revive him and get his opinion on AI but also would never want to subject him to such horrors. He would hate the way people talk about aura. Sorry we let you down, Walter. Live by WWWBD (what would walter benjamin do?)."
    },
    {
        "name": "Andrei Tarkovsky",
        "source": "Martyrolog",
        "date": "(1983)",
        "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/f/fd/Scheda_personale_di_registrazione_di_Andrei_Tarkowski_2.jpg",
        "text": "Poor Americans — with no soul, no roots, living in a land of spiritual riches, a land they don't know and don't appreciate. New York is terrible.",
        "notes": "I love to read Soviet artists view on American culture, always biting and deeply accurate (see also: Mayakovsky's writing on his American trip). I've never been to New York but I think it's probably pretty cool."
    },
    {
        "name": "Louise Glück",
        "source": "Elms",
        "date": "(1968)",
        "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/d/dd/Louise_Gl%C3%BCck_circa_1977.jpg",
        "text": "All day I tried to distinguish / need from desire. Now, in the dark, / I feel only bitter sadness for us, /t he builders, the planers of wood, / because I have been looking / steadily at these elms / and seen the process that creates / the writhing, stationary tree / is torment, and have understood / it will make no forms but twisted forms.",
        "notes": "Louise Glück !! Dreamy, visionary, spiritual. Also helped Richard Siken publish Crush, which was a staple book for me in high school."
    }
]